import pandas as pd
from cleantext import clean
import re
from asari.api import Sonar

# Initialize sonar
sonar = Sonar()

# skiprows=1000000, nrows=999999 skiprows = range(1, 1000001)

tweets = pd.read_csv('./all_tweets/tweet_data/2019/preprocessed_2019.csv', nrows=5000000)

tweets = tweets.drop(columns= 'Unnamed: 0')

kaomoji_list = ["^_^", "^ ^", "^–^", "＾＾", "(^^)", "(^ ^)", "(^.^)", "(^｡^)", "(^-^)", "(^_^)", "（＾_＾）", "（＾ν＾）", "（＾ω＾）",
"( ^ω^ )", "(o^^o)", ")^o^(", "( ◠‿◠ )", "（╹◡╹）", "^o^", "(^o^)", "(^O^)", "(^○^)", "（＾∇＾）", "（＾◇＾）", "（＾Ｏ＾）", "(＾∀＾)",
"(°▽°)", "(ﾟ∀ﾟ)", "(・∇・)", "(・∀・)", "(⌒▽⌒)", "(￣▽￣)", "(￣∇￣)", "(￣∀￣)", "(^_-)", "(＾ｰ^)", "(´∀｀)", "( ´∀｀)", "( ´ ▽ ` )",
"(о´∀`о)", "( ͡° ͜ʖ ͡°)", "(*^^*)", "(*^_^*)", "(*^ω^*)", "(^_^*)", "=(^.^)=", "(*☻-☻*)", "(*^o^*)", "(*^◯^*)", "(*^▽^*)", "(*ﾟ∀ﾟ*)", 
"(*ﾟ▽ﾟ*)", "(*’▽’*)", "(≧∀≦)", "(*≧∀≦*)", "(〃ω〃)", "(//∇//)", "(//∇//)", "（≧∇≦）", """(#^.^#)""", "(*´꒳`*)", "(*´∀｀*)",
"(*´∇｀*)", "(=´∀｀)", "(´∀｀*)", "(´∀｀=)", "(*´-`)", "(*´ー｀*)", "(*´◒`*)", "(*´ω`*)", "(*´ω｀*)", "(*´Д｀*)", "(●´ω｀●)", "(*’ω’*)",
"(*⁰▿⁰*)", "(๑>◡<๑)", "(๑･̑◡･̑๑)", "(๑╹ω╹๑ )", "(๑˃̵ᴗ˂̵)", "（╹◡╹）♡", "╰(*´︶`*)╯♡", "(((o(*ﾟ▽ﾟ*)o)))♡", "(^^)v", "(^-^)v", "(^_^)v", 
"(^_−)−☆", "(^з^)-☆", "^_−☆", "（＾Ｏ＾☆♪", "（＾＿＾）☆", "☆〜（ゝ。∂）", "(*´∀`)♪", "♪( ´θ｀)", "♪( ´▽｀)", "♪(´ε｀ )", "♪（ｖ＾＿＾）ｖ",
"ｖ（＾＿＾ｖ）♪", "♪( ´θ｀)ノ", "(  ✌ 'ω') ✌", "✌︎('ω')✌︎", "('ω'✌)", "(☝︎ ՞ਊ ՞)☝", "♪(๑ᴖ◡ᴖ๑)♪", "٩( 'ω' )و", "٩(๑❛ᴗ❛๑)۶", "٩(^‿^)۶",
"٩( ᐛ )و", "ᕦ(ò_óˇ)ᕤ", "p(^_^)q", "ψ(｀∇´)ψ", "W(`0`)W", "|(￣3￣)|", "d(￣ ￣)", "d(^_^o)", "-_-b", "(^_^)a", "  (｀_´)ゞ", "(￣^￣)ゞ",
"ʅ（◞‿◟）ʃ", "ƪ(˘⌣˘)ʃ", "_:(´ཀ`」 ∠):", "(｀・∀・´)", "(｀・ω・´)", "(=^▽^)σ", "（^人^）", "(＞人＜;)", "m(._.)m", "m(_ _)m", "o(^-^)o",
"o(^_-)O", "o(^_^)o", "o(^o^)o", "o(^▽^)o", "((o(^∇^)o))", "(((o(*ﾟ▽ﾟ*)o)))", "( ´Д`)y━･~~", "(-.-)y-., o O", "(-.-;)y-~~~", "∩^ω^∩", "(u_u)",
"(p_-)", "(@￣ρ￣@)", "(_ _).｡o○", "（´-`）.｡oO", "(-_-)zzz", "(( _ _ ))..zzzZZ", "_φ(･_･”, “＿φ(￣ー￣ )", "( T_T)＼(^-^ )", "(=´∀｀)人(´∀｀=)", 
"♪(*^^)o∀*∀o(^^*)♪", "ヽ(￣д￣;)ノ=3=3=3", "ε=ε=ε=ε=ε=ε=┌(;￣◇￣)┘", "_(:3 」∠)_", "_(┐「ε:)_", "_(:3」z)_", "＿|￣|○", "  o(･x･)/", "⊂((・x・))⊃", 
"⊂((・⊥・))⊃", "U・x・U", "U^ェ^U", "(=^x^=)", "(=^ェ^=)", "∧( ‘Θ’ )∧", "ϵ( 'Θ' )϶", "@(・●・)@", "(￣(工)￣)", "ʕ•ᴥ•ʔ", "(ᵔᴥᵔ)", ">* ))))><", "( ˊ̱˂˃ˋ̱ )", 
"☆彡", "★彡", "☆*:.｡. o(≧▽≦)o .｡.:*☆", "♪───Ｏ（≧∇≦）Ｏ────♪", "＼＼\\٩( 'ω' )و //／／", "･:*+.\(( °ω° ))/.:+", "˚✧₊⁎❝᷀ົཽ≀ˍ̮ ❝᷀ົཽ⁎⁺˳✧༚", 
"*･゜ﾟ･*:.｡..｡.:*･'(*ﾟ▽ﾟ*)’･*:.｡. .｡.:*･゜ﾟ･*", "ʕ•̫͡•ʕ•̫͡•ʔ•̫͡•ʔ•̫͡•ʕ•̫͡•ʔ•̫͡•ʕ•̫͡•ʕ•̫͡•ʔ•̫͡•ʔ•̫͡•ʕ•̫͡•ʔ•̫͡•ʔ", "( *｀ω´)", "o(｀ω´ )o", "(￣^￣)", "(⁎⁍̴̆Ɛ⁍̴̆⁎)", "(ㆀ˘･з･˘)", "(・Д・)",
"(　ﾟдﾟ)", "(ﾟωﾟ)", "(o_o)", "(O_O)", "(OvO)", "(@_@)", "(*_*)", "(°_°)", "(・・?)", "(´⊙ω⊙`)", "ʕʘ‿ʘʔ", "(๑•ૅㅁ•๑)", "Σ(-᷅_-᷄๑)", "Σ੧(❛□❛✿)",
"Σ('◉⌓◉’)", "Σ(ﾟДﾟ)", "Σ(￣。￣ﾉ)ﾉ", "Σ（ﾟдﾟlll）", "(΄◉◞౪◟◉｀)", "＼＼\٩(๑`^´๑)۶//／／", "(● ˃̶͈̀ロ˂̶͈́)੭ꠥ⁾⁾", "(;_;)", "(;o;)", "（ ; ; ）", 
"（ ; ; ）", "(´；ω；`)", "(´；Д；`)", "(；ω；)", "( ；∀；)", "(/ _ ; )", "(TT)", "(T-T)", "(T_T)", "(ToT)", "(T . T)", "(T ^ T)", "(Ｔ＿Ｔ)",
"T^T", "T_T", "（；＿；）", "（ ｉ _ ｉ ）", "(´༎ຶོρ༎ຶོ`)", ".°(ಗдಗ。)°.", "(´°ω°｀)", ">_<", "(>_<)", "(＞＜)", "(>_>)", "(ノ_＜)", "｡ﾟ(ﾟ´ω`ﾟ)ﾟ｡", 
"｡ﾟ(ﾟ´Д｀ﾟ)ﾟ｡", "。・°°・(＞_＜)・°°・。", "。・゜・(ノД`)・゜・。", "(-_-)", "(¬_¬)", "(｡-_-｡)", "(。-∀-)", "(・ω・)", "(｡･ω･｡)", "(　˙-˙　)",
"( ˘ω˘ )", "(‘ω’)", "(´ｰ｀)", "(´ω｀)", "( ´_ゝ`)", "(￣ー￣)", "（￣+ー￣）", """(^^)/""", "(^-^)/", """(^O^)/""", """(^O^)／""", "( ´ ▽ ` )ﾉ", "(*ﾟ▽ﾟ)ﾉ", 
"(*･ω･)ﾉ", "(=ﾟωﾟ)ﾉ", "(￣Д￣)ﾉ", "(・ω・)ノ", "(・Д・)ノ", "(つД`)ノ", "ヽ(^o^)", "ヽ(*´∀｀)", "ヽ(´o｀；", "ヽ(´ー｀)", "ヽ(・∀・)", "ヽ(；▽；)",
"＼(^^)／", "＼(^-^)／", "＼(^o^)／", "＼(^ω^)／", "\( ˆoˆ )/", "ヽ(´▽｀)/", "ヽ(；▽；)ノ", "ヽ(*＾ω＾*)ﾉ", "＼( ‘ω’)／", "ヾ(＠⌒ー⌒＠)ノ", "ヾ(๑╹◡╹)ﾉ",
"╰(*´︶`*)╯", "（・◇・）/~~~", "(^^)／~~~", "( ^_^)/~~~", "(ToT)/~~~", "( ; _ ; )/~~~", "(◞‸◟)", "(..)", "(._.)", "^^;", "^_^;", "(^^;", "(^^;;", "(^^;)",
"(^_^;)", "(^-^;", "(^◇^;)", "f^_^;", "σ^_^;", "σ(^_^;)", "(･･;)", "(･_･;", "(・・;)", "(ｰｰ;)", "(ｰ ｰ;)", "(-_-;)", "(-｡-;", "~_~;", "(~_~;)", "´д` ;",
"(;´д｀)", "(；´Д`A", "( ；´Д｀)", "ε-(´∀｀; )", "(ﾟoﾟ;;", "(⌒-⌒; )", "(￣O￣;)", "(￣◇￣;)", "(￣▽￣;)", "（ーー；）", "（−＿−；）", "（；￣ェ￣）",
"Σ（・□・；）", "(´･_･`)", "(´･Д･)」", "(´･ω･`)", "(´・ω・)", "(´・∀・｀)", "(´・ω・｀)", "(・ω・｀)", "(´-ω-`)", "(´ω`)", "( ´△｀)", "(´Д` )", "(ﾉД`)",
"orz", "囧", "囧rz", "ಠ_ಠ", """(c" ತ,_ತ)""", ":;(∩´﹏`∩);:", "ʕ⁎̯͡⁎ʔ༄", "(笑)", "(泣)", "(爆)", "(爆笑)", "(苦笑)", "(汗)", "(大汗)", "(´+ω+｀)"]

punctuation_list = ["。", "、", "—", "–", "〜", "（", "）", "「", "」", "『", "』", "【", "】", "＜", "＞", "《", "》", "｛", "｝", "［", "］", "〔", "〕", "‘",
"’", "“", "”", "...", "..", "！", "？"]

tweets['tweet_text_negative_score'] = ""
tweets['clean_tweet_text'] = ""
tweets['clean_tweet_text_negative_score'] = ""

for x in range(len(tweets)):
    tweet_text = tweets['tweet_text'][x]

    sentiment1 = sonar.ping(tweet_text)

    tweets['tweet_text_negative_score'][x] = sentiment1['classes'][0]['confidence']

    # Remove kaomoji from the tweet text
    for kaomoji in kaomoji_list:
        tweet_text = tweet_text.replace(kaomoji, "")

    # Remove URLs, emails, and emojis from the tweet text
    tweet_text = clean(tweet_text, lang = 'jp', to_ascii = False, no_urls = True, replace_with_url = "", no_emails = True, replace_with_email= "")

    # Remove twitter @s from the tweet text
    tweet_text = re.sub('@[\w]+','', tweet_text)

    # Remove punctuation from the tweet text
    tweet_text = clean(tweet_text, to_ascii = False, lang = 'jp', no_punct = True, no_emoji = True)

    # Remove any other punctuation not already removed from the tweet text
    for punctuation in punctuation_list:
        tweet_text = tweet_text.replace(punctuation, "")

    # Remove any leftover URLs that may not have been picked up from the tweet text
    tweet_text = re.sub('https[\w]+','', tweet_text)

    tweets['clean_tweet_text'][x] = str(tweet_text)

    sentiment2 = sonar.ping(tweet_text)

    tweets['clean_tweet_text_negative_score'][x] = sentiment2['classes'][0]['confidence']

    print(x)

tweets.to_csv('./tweets_clean_2019_1.csv', index = False)   

